{"hed":"wonky","dek":"an interactive accompaniment to “Dilla Time” by Dan Charnas","byline":"By <a href=https://pudding.cool/author/michelle-mcghee/ target=_blank>Michelle McGhee</a>","sections":[{"id":"intro","chunks":[{"type":"p","text":"You’re the drummer. The backbone of the band. Your job is to keep a steady rhythm."},{"type":"p","text":"Here, try it."},{"type":"div","component":"Grid","props":{"id":"intro_beat","playable":"true","measures":"4","beatsPerMeasure":"4"}},{"type":"p","text":"Nice job. Sometimes you were a little late or a little early. To correct this, we can snap every note to the nearest steady beat. This is called quantizing, and most music recording software lets you do this with the click of a button."},{"type":"p","text":"Now listen to this clip of “Sincerity is Scary” by The 1975. Below we’re just visualizing the hi-hat, which is the part of the drum kit that sounds like this."},{"type":"div","component":"Grid","props":{"id":"sincerity","measures":"4","beatsPerMeasure":"4"}},{"type":"p","text":"This rhythm is not even at all. Some hits come slightly early, others slightly late. It’s the rhythmic equivalent of coloring a little outside of the lines or playing slightly out of tune."},{"type":"p","text":"But at the same time... it’s groovy. It’s chill, laid back, off-kilter, sort of like you’re falling but never quite catching yourself."},{"type":"p","text":"These are professional musicians - they know what they’re doing, and there’s intention behind it. They’re following in the tradition of artists like J Dilla, who pioneered this style of playing off the grid, which went against what musicians are typically taught, to play perfectly evenly."},{"type":"div","component":"Quote","props":{"quote":"“It was the most life-changing moment I ever had… it sounded like the kick drum was played by a drunk 3 year old. And I was like, are you allowed to do that?”","speaker":"Questlove","videoUrl":""}},{"type":"p","text":"And these days, it shows up everywhere in popular music if you listen closely."},{"type":"p","text":"Dan Charnas wrote a book called “Dilla Time”, all about J Dilla’s music, life, and legacy. I want to focus on the timefeel that Dilla pioneered. How does it work? What does it look and sound like? The book was great, but I wanted visuals I could interact with."}]},{"id":"straight","title":"🥁 part i: straight","chunks":[{"type":"p","text":"The quantized beat you made is described as rhythmically “straight.” This means that the notes line up with our typical evenly spaced grid. Here are some other songs with straight grooves."},{"type":"div","component":"Grid","props":{"id":"lightSwitch","measures":"4","beatsPerMeasure":"4"}}]},{"id":"swing","title":"🥁🥁 part ii: swing","chunks":[{"type":"p","text":"Sometimes straight can get a little boring. If we move every other note (called the “backbeat”) on the hi-hat a bit later, we get what’s called swing. This is very common in jazz. Here are some songs with swung grooves."},{"type":"div","component":"Grid","props":{"id":"dmatSwung","measures":"2","beatsPerMeasure":"4"}}]},{"id":"nerd-box","summary":"How do drummers know how late to put the backbeat?","chunks":[{"type":"p","text":"Different drummers have different techniques, but some count it very exactly. To understand this, let’s look at 1 beat. This circle represents 1 beat."},{"type":"div","component":"Circle","props":{"dots":["0"]}},{"type":"p","text":"If we divide the beat in 2, we get this classic sound. The backbeat and the downbeat take the same amount of space."},{"type":"div","component":"Circle","props":{"dots":["0","0.5"],"division":"2"}},{"type":"p","text":"It gets interesting if we try dividing the beat into an odd number of divisions. Then we’re forced to have one note be longer than the other. Dividing in 3, we can have the first note take 2/3 and the second take 1/3. This is called a triplet swing. It’s also referred to as a 66% swing percentage because that’s the amount of the beat taken up by the first note."},{"type":"p","text":"Try it out, see what different numbers feel like."},{"type":"div","component":"Circle","props":{"interactive":"true","division":"3"}}]},{"id":"dilla","title":"🥁🥁🥁 part iii: dilla","chunks":[{"type":"p","text":"To understand what makes Dilla time special, it’s all about what the best artists do - subverting expectation."},{"type":"div","component":"Quote","props":{"quote":"To hear a rhythm at all, we must have at least two events spaced in time: like a snare hit, then a pause of any length, then another hit: positive-negative-positive. Once a pattern is established it sets up an expectation. We expect to hear an event in a positive (or “strong”) space, and do not expect to hear one in a negative (or “weak”) space.","speaker":"Dan Charnas (Dilla Time)"}},{"type":"div","component":"Quote","props":{"quote":"Our expectations are governed by the most granular pulse in a given song, what we call the rhythmic current. In hip-hop, we expect to hear a beat counted in fours. Usually the hi-hat acts as the metronome, and because it hits two times for every one of those four beats, it sets the rhythmic current at eight.","speaker":"Dan Charnas (Dilla Time)"}},{"type":"div","component":"Quote","props":{"quote":"Because the rhythmic current - the most granular pulse - governs our expectations, changes on a microscopic level can ironically be jarring, and it is in this area, subverting the rhythmic current that [J Dilla] did most of his work. In a typical J Dilla beat, the rushed snare messes with our expectations by falling into a weak area of the rhythmic current and not a strong one.","speaker":"Dan Charnas (Dilla Time)"}}]}]}