{"hed":"wonky","dek":"an exploration of rhythm and grooves that break the rules","byline":"By <a href=https://pudding.cool/author/michelle-mcghee/ target=_blank>Michelle McGhee</a>","sections":[{"id":"intro","chunks":[{"type":"div","component":"Scroll","steps":[{"text":"One night outside a small music venue in North Carolina, Questlove’s life was changed forever. He was in the car leaving the venue when he heard a beat coming from inside that sounded… wrong."},{"text":"“As I’m leaving the club, I'm hearing the vibration of the kick drum. it was the most life-changing moment I ever had… like, did I hear that? it sounded like the kick drum was played by a drunk 3-year old, and i was like ‘are you allowed to do that?’” -Questlove","sound":"drunk"},{"text":"The drums are, in many ways, the backbone of the band. They provide a steady beat for the other musicians to follow. Up until this point, Questlove, like many drummers, had essentially trained to be a metronome, keeping perfect time.","sound":"normal","showNotes":"true"},{"text":"But what he heard that night was the opposite of perfect - some notes hit slightly sooner than expected or slightly later. The whole thing was unbalanced, off-kilter, unexpected. And it was… awesome.","sound":"drunk","showNotes":"true"},{"text":"“I’d never heard someone not give a fuck, and that to me was the most liberating moment. like, all this pleasing my father, being perfect… Now I've got to undo all the education and all the hours of preparation that I did.” -Questlove"},{"text":"The beat Questlove was hearing was made by JDilla, a producer who pioneered an all-new way to think about rhythm that influences musicians to this day. It’s not just chaos, there’s a method to the madness. What’s going on and why does it work? Let’s dive in."}]}]},{"id":"straight","title":"straight","chunks":[{"type":"p","text":"Let’s begin with a basic groove."},{"type":"div","component":"Song","songId":"straight"},{"type":"p","text":"This groove is straight, everything lines up perfectly to this evenly spaced grid, happens when you would expect. You hear a note, a space, then another note, and that distance stays the same. It’s the way Questlove had trained so hard to play."},{"type":"p","text":"Here are some songs with straight grooves. How do they feel to you? To me it feels: precise, even, tight."}]},{"id":"swing","title":"swing","chunks":[{"type":"p","text":"Sometimes straight can get a little boring. Playing with a swing feel means delaying the backbeats, the notes in between the downbeats. This is common in jazz. The whole band does it, so it’s almost like the grid is getting stretched out and everyone’s playing on a new grid. It sounds like this:"},{"type":"div","component":"Song","songId":"triplet"},{"type":"p","text":"Here are some songs with swung grooves. Can you hear a difference from the straight grooves? To me, these feel looser, make me want to dance and shake my head."}]},{"id":"shift","title":"shift","chunks":[{"type":"p","text":"Another interesting way to play off the grid is to shift an entire part over. This is easy to do with a drum machine. Common JDilla technique. Move the snare a little early and it creates this flam effect."},{"type":"div","component":"Song","songId":"shift"}]},{"id":"dilla","title":"straight + swing + shift = dilla’s unique timefeel","chunks":[{"type":"p","text":"What dilla did was combine all of these elements together, different parts playing with different timefeels."},{"type":"div","component":"Song","songId":"dilla"},{"type":"p","text":"This is a toy example that uses Dilla elements, but every Dilla and Dilla-like song is different, using different combinations of elements. For example, this Erykah Badu song, which is similar to our example."}]}]}