{"hed":"wonky","dek":"An exploration of rhythm and grooves that break the rules","byline":"By <a href=https://pudding.cool/author/michelle-mcghee/ target=_blank>Michelle McGhee</a>","sections":[{"id":"intro","chunks":[{"type":"div","component":"Scroll","steps":[{"text":"One night outside a small music venue in North Carolina, Questlove’s life was changed forever. He was in the car leaving the venue when he heard a beat coming from inside that sounded… wrong."},{"text":"“As I’m leaving the club, I'm hearing the vibration of the kick drum. It was the most life-changing moment I ever had… like, did I hear that? It sounded like the kick drum was played by a drunk 3-year old, and i was like ‘are you allowed to do that?’” -Questlove","classname":"quote","sound":"drunk"},{"text":"The drums are, in many ways, the backbone of the band. They provide a steady beat for the other musicians to follow. Up until this point, Questlove, like many drummers, had essentially trained to be a metronome, keeping perfect time.","sound":"normal","showNotes":"true"},{"text":"But what he heard that night was the opposite of perfect - some notes hit slightly sooner than expected or slightly later. The whole thing was unbalanced, off-kilter, unexpected. And it was… awesome.","sound":"drunk","showNotes":"true"},{"text":"“I’d never heard someone not give a fuck, and that to me was the most liberating moment. like, all this pleasing my father, being perfect… Now I've got to undo all the education and all the hours of preparation that I did.” -Questlove","classname":"quote"},{"text":"The beat Questlove was hearing was made by JDilla, a producer who pioneered an all-new way to think about rhythm that influences musicians to this day. It’s not just chaos, there’s a method to the madness. What’s going on and why does it work? Let’s dive in."}]}]},{"id":"straight","title":"straight","chunks":[{"type":"p","text":"Let’s begin with a basic groove."},{"type":"div","component":"Demo","songId":"straight","notes":["Right now we have nothing. Click the button on the right to add in the bass.","The bass is going playing 2 notes for every beat. A beat is when you nod your head. Add in the hi-hat.","The hi-hat is a cymbal, part of the drum kit. Also playing 2 notes every beat. Add in the kick.","The kick drum aka the bass drum plays on the first and third beat. Finally, add in the snare.","The snare plays on the second and fourth. Like where you would clap. Nice job, you made a groove! You can click on any of the tracks to mute/unmute them."]},{"type":"p","text":"This groove is straight, everything lines up perfectly to this evenly spaced grid, happens when you would expect. You hear a note, a space, then another note, and that distance stays the same. It’s the way Questlove had trained so hard to play."},{"type":"p","text":"Here are some songs with straight grooves. How do they feel to you? To me it feels: precise, even, tight."},{"type":"div","component":"Song","song":"Stars and Stripes Forever","artist":"John Philip Sousa","url":"https://p.scdn.co/mp3-preview/752705adcabd783103808a0dde531aed67c06a9c?cid=cfe923b2d660439caf2b557b21f31221"},{"type":"div","component":"Song","song":"Light Switch","artist":"Charlie Puth","url":"https://p.scdn.co/mp3-preview/135cce6ee2119c739643b3bbc15465623a60522c?cid=cfe923b2d660439caf2b557b21f31221"}]},{"id":"swing","title":"swing","chunks":[{"type":"p","text":"Sometimes straight can get a little boring. Playing with a swing feel means delaying the backbeats, the notes in between the downbeats. This is common in jazz. The whole band does it, so it’s almost like the grid is getting stretched out and everyone’s playing on a new grid. It sounds like this:"},{"type":"div","component":"Demo","songId":"triplet","notes":["We’ll start off with the same straight groove. Click to make the bass swing.","We’ll also swing the hi-hat.","Now we’re talking!"]},{"type":"p","text":"Here are some songs with swung grooves. Can you hear a difference from the straight grooves? To me, these feel looser, make me want to dance and shake my head."},{"type":"div","component":"Song","song":"It Don’t Mean a Thing (If It Ain’t Got That Swing)","artist":"Louis Armstrong","url":"https://p.scdn.co/mp3-preview/29df7433a8ed007b4e41fa010b625fabcd8e255e?cid=cfe923b2d660439caf2b557b21f31221"},{"type":"div","component":"Song","song":"Groovin’ Hard","artist":"Buddy Rich","url":"https://p.scdn.co/mp3-preview/fffd6028da8ddbc5f3db910bcb60b9ac5127b041?cid=cfe923b2d660439caf2b557b21f31221"}]},{"id":"shift","title":"shift","chunks":[{"type":"p","text":"Another interesting way to play off the grid is to shift an entire part over. This is easy to do with a drum machine. Common JDilla technique. Move the snare a little early and it creates this flam effect."},{"type":"div","component":"Demo","songId":"shift","notes":["Starting with the straight groove. This one is a subtle change, so listen carefully. Click to shift the snare ever so slightly.","Ooh… try going back and forth and see if you hear the difference. It also might help to mute the bass and kick to just hear that flam with the hi-hat against the shifted share."]}]},{"id":"dilla","title":"straight + swing + shift = dilla’s unique timefeel","chunks":[{"type":"p","text":"What dilla did was combine all of these elements together, different parts playing with different timefeels."},{"type":"div","component":"Demo","songId":"dilla","notes":["Starting out straight. Not for long… let’s start by swinging the bass. A little less steep than a triplet swing, a quintuplet swing (see previous advanced swing section).","We’ll actually leave the hi-hat and snare straight for a little extra tension. Go ahead and shift the snare slightly early.","Sweet! We’ve got straight, swung, and shifted parts, which creates a satisfying tension."]},{"type":"p","text":"This is a toy example that uses Dilla elements, but every Dilla and Dilla-like song is different, using different combinations of elements. For example, this Erykah Badu song, which is similar to our example."},{"type":"div","component":"Song","song":"Fall In Love","artist":"Erykah Badu","url":"https://p.scdn.co/mp3-preview/893fe3a302753f4ef1b8d0e8f5667440ac18e37e?cid=cfe923b2d660439caf2b557b21f31221"},{"type":"div","component":"Song","song":"Chicken Grease","artist":"D’Angelo","url":"https://p.scdn.co/mp3-preview/6484d10f8164fe05049a66249b01d28af83cd97c?cid=cfe923b2d660439caf2b557b21f31221"},{"type":"div","component":"Song","song":"E=mc^2","artist":"J Dilla","url":"https://p.scdn.co/mp3-preview/0c6eb1b7f320113c9fb519f21424187cb2795864?cid=cfe923b2d660439caf2b557b21f31221"},{"type":"div","component":"Song","song":"How Much a Dollar Cost","artist":"Kendrick Lamar","url":"https://p.scdn.co/mp3-preview/4a76b5141c4b79750a2576da244d5c1e39877dc7?cid=cfe923b2d660439caf2b557b21f31221"},{"type":"div","component":"Song","song":"Heart Don’t Stand a Chance","artist":"Anderson Paak","url":"https://p.scdn.co/mp3-preview/4d6f2fd262a1ab06b0491e5eff8a1b990d51720a?cid=cfe923b2d660439caf2b557b21f31221"},{"type":"div","component":"Song","song":"Saviour","artist":"Jacob Collier","url":"https://p.scdn.co/mp3-preview/7152f16262094987731b6a74da339f5220ac95b9?cid=cfe923b2d660439caf2b557b21f31221"}]},{"id":"conclusion","chunks":[{"type":"p","text":"Conclusion, something about subverting expectations and art. Coloring outside of the lines, playing “out of tune” / a “wrong” note, rules being overrated, it’s all about how it feels."}]}]}