{
	"hed": "The math and the magic of wonky grooves",
	"dek": "Visualizing wonky grooves",
	"byline": "By <a href=https://pudding.cool/author/michelle-mcghee/ target=_blank>Michelle McGhee</a>",
	"intro": [
		{
			"type": "text",
			"value": "You’re the drummer. The backbone of the band. Your job is to keep a steady rhythm. Here, try it."
		},
		{
			"type": "text",
			"value": "[imagine] You try to tap a rhythm on your keyboard."
		},
		{
			"type": "text",
			"value": "Nice job. Sometimes you were a <span class=off>little late</span> or a <span class=off>little early</span>."
		},
		{
			"type": "text",
			"value": "With quantizing, we can snap it all into perfect place."
		},
		{
			"type": "text",
			"value": "Now listen to this (TBD what song, something modern with Dilla influences)."
		},
		{
			"type": "text",
			"value": "The beat is wonky, it’s irregular. some beats are *slightly* late, others are early. It’s not exactly perfect. But… it’s groovy. It’s laid back, sort of off-kilter, which some people love. It shows up everywhere in popular music if you listen closely. Why does being off the grid, out of time, the rhythmic equivalent of playing out of tune, work?"
		},
		{
			"type": "text",
			"value": "This is a beat made by the hit-less, yet revered producer JDilla. Dan Charnas wrote a whole <a href=https://dillati.me/ target=_blank>book</a> about it that I just read. It talks about JDilla’s life and his enormous contribution to music - a brand new way of conceiving of time. But even after reading it, I wanted visuals I could see, hear, and play with (at the same time) to really get an understanding of how Dilla changed music."
		}
	],
	"straight": [
		{ "type": "text", "value": "<strong>Part 1: Straight</strong>" },
		{
			"type": "text",
			"value": "The beat you made, once quantized, is called <strong>straight</strong>. Press play to hear it."
		},
		{
			"type": "text",
			"value": "Now let’s bring in the other parts of the drums. In this visual, every little rectangle is a note played by one of the 3 parts of the drum kit: hi-hat, snare, and kick drum. The full bar represents 4 beats, or 1 measure. A straight groove has evenly spaced beats."
		},
		{
			"type": "text",
			"value": "Here’s a song with a straight groove. [will show on viz]"
		}
	],
	"swing": [
		{ "type": "text", "value": "<strong>Part 2: Swing</strong>" },
		{
			"type": "text",
			"value": "Sometimes straight can be a little boring. If we move every other note on the hihat a little bit later, we get what’s called <strong>swing</strong>. This is very common in jazz."
		},
		{
			"type": "text",
			"value": "Here’s a song with a swung groove. [will show on viz]"
		},
		{
			"type": "text",
			"value": "Swing can get really interesting. You can delay that hihat note different amounts and get very different feels. Listen to this song [show on viz]. Every other hihat is late, but not as late as the last example."
		},
		{
			"type": "text",
			"value": "[viz] slider where you can change the swing percentage"
		}
	],
	"dilla": [
		{ "type": "text", "value": "<strong>Part 3: Dilla</strong>" },
		{
			"type": "text",
			"value": "Straight and swung used to be the only two ways. A Dilla timefeel is one that combines straight, swung, and shifted elements to create an all-new funky timefeel."
		},
		{ "type": "text", "value": "Let’s take your groove and Dilla-ify it." },
		{
			"type": "text",
			"value": "1) The kick is straight. 2) The hihat is swung slightly. 3) The snare is shifted slightly early to create a flam against the hihat."
		},
		{
			"type": "text",
			"value": "Each instrument is on their own grid, and the way they interplay is really satisfying."
		},
		{ "type": "text", "value": "Here’s another JDilla groove." },
		{
			"type": "text",
			"value": "Here’s a song by [modern artist] with a Dilla groove."
		}
	]
}
